app/controllers/todo_lists_controller.rb

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["title", ""], ["description", "\r\n"], ["updated_at", "2019-10-17 19:57:50.742040"], ["id", 6]]